Autodesk.Revit.UI.FormaNotificationDuration
The duration of the notification timer.
Since:
2027
Since:
2027

Autodesk.Revit.UI.FormaNotificationDuration.AlwaysOn
The toast notification stays on until the user closes it or the next message comes in.

Autodesk.Revit.UI.FormaNotificationDuration.Long
The long duration to keep the toast notification for 25 seconds.

Autodesk.Revit.UI.FormaNotificationDuration.Short
The default duration to keep the toast notification for 7 seconds.